In [8]:
import pandas as pd
import numpy as np
import pickle
from scipy import stats 
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt
from pydataset import data
import warnings
import sidetable
warnings.filterwarnings('ignore')

plt.rcParams["figure.figsize"] = (10,8)

pd.options.display.max_columns = None

## EDA

In [5]:
df = pd.read_csv('data/encuesta_limpia.csv', index_col= 0)
df.sample()

,age,gender,Q3,Q4,Q5,Q7,Q8,Q9,Q11,Q14,Q20,Q21,Q22,Q24,Q25,Q32,Q33,Q41,q_10_completa,q_27_completa,q_29_completa,q_40_completa,q_42_completa
20158,35-39,Man,United Arab Emirates,Master’s degree,Software Engineer,"Python, SQL, Javascript",Python,"Visual Studio ,PyCharm , Notepad++,MATLAB",A laptop,"Matplotlib ,Seaborn",Government/Public Service,250-999 employees,0,None of these activities are an important part of my role at work,"50,000-59,999",Microsoft SQL Server,NaN,"Business intelligence software (Salesforce, Tableau, Spotfire, etc.)",None,"Microsoft Azure , IBM Cloud / Red Hat",No / None,University Courses (resulting in a university degree),"YouTube (Kaggle YouTube, Cloud AI Adventures, etc)"

In [1]:
def exploracion(df):

    print(f"El dataframe tiene {df.shape[0]} filas y {df.shape[1]} columnas")  
    print("---")
    print(df.info())
    print("---")
    columnas = [df.columns[num] for num in range(len(df.columns))]
    print(f"Los nombres de las columnas son {columnas}")
    print("---")
    print(f"A continuación se muestran los principales estadísticos numéricos del dataframe {df}:")
    print(df.describe().T)
    print(f"A continuación se muestran los principales estadísticos categóricos del dataframe {df}:")
    print(df.describe(include = "object").T)
    print("---")
    print("Los porcentajes de valores nulos por cada columna son:")
    print(df.isnull().sum() * 100/df.shape[0])
    print("---")
    valores_unicos = [len(df[col].value_counts())for col in columnas]
    valores_unicos_por_columna = list(zip(columnas, valores_unicos))
    print("Estos son los valores únicos por cada columna")
    print(valores_unicos_por_columna)
    print("---")
    print("Los valores duplicados por cada columna son:")
    print(df.duplicated().sum())

In [6]:
exploracion(df)

El dataframe tiene 25973 filas y 23 columnas
---
<class 'pandas.core.frame.DataFrame'>
Int64Index: 25973 entries, 0 to 25972
Data columns (total 23 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            25973 non-null  object
 1   gender         25973 non-null  object
 2   Q3             25973 non-null  object
 3   Q4             25973 non-null  object
 4   Q5             25973 non-null  object
 5   Q7             24941 non-null  object
 6   Q8             24940 non-null  object
 7   Q9             24934 non-null  object
 8   Q11            24720 non-null  object
 9   Q14            23970 non-null  object
 10  Q20            16325 non-null  object
 11  Q21            16251 non-null  object
 12  Q22            16126 non-null  object
 13  Q24            15635 non-null  object
 14  Q25            15391 non-null  object
 15  Q32            9484 non-null   object
 16  Q33            4656 non-null   object
 17  Q41            18489 non-null  object
 18  q_10_completa  24810 non-null  object
 19  q_27_completa  9721 non-null   object
 20  q_29_completa  6234 non-null   object
 21  q_40_completa  19209 non-null  object
 22  q_42_completa  18329 non-null  object
dtypes: object(23)
memory usage: 4.8+ MB
None
---
Los nombres de las columnas son ['age', 'gender', 'Q3', 'Q4', 'Q5', 'Q7', 'Q8', 'Q9', 'Q11', 'Q14', 'Q20', 'Q21', 'Q22', 'Q24', 'Q25', 'Q32', 'Q33', 'Q41', 'q_10_completa', 'q_27_completa', 'q_29_completa', 'q_40_completa', 'q_42_completa']
---
A continuación se muestran los principales estadísticos numéricos del dataframe          age gender                        Q3                 Q4  \
0      50-54    Man                     India  Bachelor’s degree
1      50-54    Man                 Indonesia    Master’s degree
2      22-24    Man                  Pakistan    Master’s degree
3      45-49    Man                    Mexico    Doctoral degree
4      45-49    Man                     India    Doctoral degree
...      ...    ...                       ...                ...
25968  30-34    Man                     Egypt  Bachelor’s degree
25969  22-24    Man                     China    Master’s degree
25970  50-54    Man                    Sweden    Doctoral degree
25971  45-49    Man  United States of America    Master’s degree
25972  18-21    Man                     India  Bachelor’s degree

                            Q5                             Q7      Q8  \
0                        Other                      Python, R  Python
1      Program/Project Manager              SQL, C, C++, Java  Python
2            Software Engineer              Python, C++, Java  Python
3           Research Scientist                         Python  Python
4                        Other              Python, C, MATLAB  Python
...                        ...                            ...     ...
25968             Data Analyst  Python, SQL, Javascript, Bash  Python
25969                  Student                         Python  Python
25970       Research Scientist                            NaN     NaN
25971           Data Scientist                    Python, SQL  Python
25972         Business Analyst                            NaN     NaN

                                                                                              Q9  \
0                                                                                    Vim / Emacs
1                                                                     Notepad++,Jupyter Notebook
2                                                               PyCharm ,Jupyter Notebook, Other
3                                                                        Spyder,Jupyter Notebook
4                                                                Spyder,MATLAB ,Jupyter Notebook
...                                                                                          ...
25968  Jupyter (JupyterLab, Jupyter Notebooks, etc) ,Visual Studio Code (VSCode) , Vim / Emac...
25969                                                                                   PyCharm
25970                                                                                        NaN
25971                                                                 Notepad++,Jupyter Notebook
25972                                                                                        NaN

                                                                       Q11  \
0                                                                 A laptop
1      A cloud computing platform (AWS, Azure, GCP, hosted notebooks, etc)
2                                                                 A laptop
3      A cloud computing platform (AWS, Azure, GCP, hosted notebooks, etc)
4      A cloud computing platform (AWS, Azure, GCP, hosted notebooks, etc)
...                                                                    ...
25968                                                             A laptop
25969                                        A personal computer / desktop
25970                                                                  NaN
25971                                                             A laptop
25972                                                                  NaN

                                                                    Q14  \
0       Matplotlib ,Seaborn ,Ggplot / ggplot2 ,Shiny ,Leaflet / Folium
1                                                           Matplotlib
2                                                           Matplotlib
3                                                           Matplotlib
4                                Matplotlib ,Seaborn ,Ggplot / ggplot2
...                                                                 ...
25968                                              Matplotlib ,Seaborn
25969                                                              None
25970                                                               NaN
25971                                              Matplotlib ,Seaborn
25972                                                               NaN

                                          Q20                       Q21  Q22  \
0                   Manufacturing/Fabrication          50-249 employees  3-4
1                   Manufacturing/Fabrication      1000-9,999 employees  1-2
2                         Academics/Education      1000-9,999 employees    0
3                         Academics/Education      1000-9,999 employees    0
4                         Academics/Education          50-249 employees  5-9
...                                       ...                       ...  ...
25968                    Computers/Technology  10,000 or more employees  20+
25969                                     NaN                       NaN  NaN
25970                     Academics/Education      1000-9,999 employees  20+
25971  Online Service/Internet-based Services  10,000 or more employees  20+
25972                                   Other            0-49 employees    0

                                                                                             Q24  \
0                              None of these activities are an important part of my role at work
1       Build and/or run the data infrastructure that my business uses for storing, analyzing...
2                              None of these activities are an important part of my role at work
3                             Do research that advances the state of the art of machine learning
4      Analyze and understand data to influence product or business decisions, Build prototyp...
...                                                                                          ...
25968  Analyze and understand data to influence product or business decisions, Build and/or r...
25969                                                                                        NaN
25970                          None of these activities are an important part of my role at work
25971                                                                                        NaN
25972                     Analyze and understand data to influence product or business decisions

                 Q25  \
0      25,000-29,999
1      60,000-69,999
2             $0-999
3      30,000-39,999
4      30,000-39,999
...              ...
25968  15,000-19,999
25969            NaN
25970         $0-999
25971            NaN
25972         $0-999

                                                                            Q32  \
0                                                                   PostgreSQL
1                                                                           NaN
2                                                              MySQL , MongoDB
3                                                                           NaN
4                                                                          None
...                                                                         ...
25968   PostgreSQL , SQLite , MongoDB , Microsoft SQL Server , Amazon Redshift
25969                                                                       NaN
25970                                                                       NaN
25971                                                                       NaN
25972                                                                       NaN

            Q33  \
0           NaN
1           NaN
2        MySQL
3           NaN
4           NaN
...         ...
25968  MongoDB
25969       NaN
25970       NaN
25971       NaN
25972       NaN

                                                                        Q41  \
0                Local development environments (RStudio, JupyterLab, etc.)
1                           Advanced statistical software (SPSS, SAS, etc.)
2         Basic statistical software (Microsoft Excel, Google Sheets, etc.)
3                Local development environments (RStudio, JupyterLab, etc.)
4                Local development environments (RStudio, JupyterLab, etc.)
...                                                                     ...
25968  Business intelligence software (Salesforce, Tableau, Spotfire, etc.)
25969                                                                   NaN
25970     Basic statistical software (Microsoft Excel, Google Sheets, etc.)
25971                                                                   NaN
25972                       Advanced statistical software (SPSS, SAS, etc.)

                                                                                   q_10_completa  \
0                                                                                Colab Notebooks
1                                                             Colab Notebooks,  Kaggle Notebooks
2                                                                               Kaggle Notebooks
3                                                                                Colab Notebooks
4                                                                           Google Cloud Datalab
...                                                                                          ...
25968   Databricks Collaborative Notebooks ,  Amazon Sagemaker Studio Notebooks ,  Amazon EMR...
25969                                                                                       None
25970                                                                                        NaN
25971                                                                                       None
25972                                                                                        NaN

                                        q_27_completa  \
0                        Google Cloud Platform (GCP)
1                                                 NaN
2                                                None
3                                                 NaN
4                                    Microsoft Azure
...                                               ...
25968   Microsoft Azure ,  Amazon Web Services (AWS)
25969                                             NaN
25970                                             NaN
25971                                             NaN
25972                                             NaN

                                                                  q_29_completa  \
0                                                  Google Cloud Compute Engine
1                                                                           NaN
2                                                                           NaN
3                                                                           NaN
4                                             Microsoft Azure Virtual Machines
...                                                                         ...
25968   Microsoft Azure Virtual Machines ,  Amazon Elastic Compute Cloud (EC2)
25969                                                                       NaN
25970                                                                       NaN
25971                                                                       NaN
25972                                                                       NaN

                                                                                   q_40_completa  \
0                                  Udacity, Coursera, edX, DataCamp, Kaggle Learn Courses, Udemy
1      Kaggle Learn Courses, University Courses (resulting in a university degree), Cloud-cer...
2                                                                                       DataCamp
3                                                                                  Coursera, edX
4                                                                    Kaggle Learn Courses, Udemy
...                                                                                          ...
25968  Udacity, Coursera, Cloud-certification programs (direct from AWS, Azure, GCP, or simil...
25969                                                                                        NaN
25970                                                                Coursera, LinkedIn Learning
25971                                                                                        NaN
25972                                                                                       None

                                                                                   q_42_completa
0      Kaggle (notebooks, forums, etc), Journal Publications (peer-reviewed journals, confere...
1                     Journal Publications (peer-reviewed journals, conference proceedings, etc)
2            Kaggle (notebooks, forums, etc), YouTube (Kaggle YouTube, Cloud AI Adventures, etc)
3      YouTube (Kaggle YouTube, Cloud AI Adventures, etc), Journal Publications (peer-reviewe...
4                     Journal Publications (peer-reviewed journals, conference proceedings, etc)
...                                                                                          ...
25968  Kaggle (notebooks, forums, etc), YouTube (Kaggle YouTube, Cloud AI Adventures, etc), S...
25969                                                                                        NaN
25970                                                                                       None
25971                                                                                        NaN
25972                                                                                       None

[25973 rows x 23 columns]:
               count unique  \
age            25973     11
gender         25973      5
Q3             25973     66
Q4             25973      7
Q5             25973     15
Q7             24941    825
Q8             24940     13
Q9             24934   1330
Q11            24720      6
Q14            23970    467
Q20            16325     18
Q21            16251      5
Q22            16126      7
Q24            15635     96
Q25            15391     26
Q32             9484   1558
Q33             4656     20
Q41            18489      6
q_10_completa  24810    723
q_27_completa   9721    280
q_29_completa   6234     16
q_40_completa  19209    905
q_42_completa  18329    909

                                                                                  top  \
age                                                                             25-29
gender                                                                            Man
Q3                                                                              India
Q4                                                                    Master’s degree
Q5                                                                            Student
Q7                                                                             Python
Q8                                                                             Python
Q9                                                                   Jupyter Notebook
Q11                                                                          A laptop
Q14                                                              Matplotlib ,Seaborn
Q20                                                              Computers/Technology
Q21                                                                    0-49 employees
Q22                                                                               1-2
Q24            Analyze and understand data to influence product or business decisions
Q25                                                                            $0-999
Q32                                                                              None
Q33                                                                            MySQL
Q41                 Basic statistical software (Microsoft Excel, Google Sheets, etc.)
q_10_completa                                                                    None
q_27_completa                                                                    None
q_29_completa                                                               No / None
q_40_completa                                                                    None
q_42_completa                                         Kaggle (notebooks, forums, etc)

                freq
age             4931
gender         20598
Q3              7434
Q4             10132
Q5              6804
Q7              4740
Q8             20213
Q9              2341
Q11            16231
Q14             5697
Q20             4079
Q21             5055
Q22             3642
Q24             2891
Q25             3369
Q32             2297
Q33             1110
Q41             7246
q_10_completa   7174
q_27_completa   2689
q_29_completa   1795
q_40_completa   1762
q_42_completa   1224
A continuación se muestran los principales estadísticos categóricos del dataframe          age gender                        Q3                 Q4  \
0      50-54    Man                     India  Bachelor’s degree
1      50-54    Man                 Indonesia    Master’s degree
2      22-24    Man                  Pakistan    Master’s degree
3      45-49    Man                    Mexico    Doctoral degree
4      45-49    Man                     India    Doctoral degree
...      ...    ...                       ...                ...
25968  30-34    Man                     Egypt  Bachelor’s degree
25969  22-24    Man                     China    Master’s degree
25970  50-54    Man                    Sweden    Doctoral degree
25971  45-49    Man  United States of America    Master’s degree
25972  18-21    Man                     India  Bachelor’s degree

                            Q5                             Q7      Q8  \
0                        Other                      Python, R  Python

In [9]:
df.stb.missing()

               missing  total    percent
Q33              21317  25973  82.073692
q_29_completa    19739  25973  75.998152
Q32              16489  25973  63.485158
q_27_completa    16252  25973  62.572672
Q25              10582  25973  40.742309
Q24              10338  25973  39.802872
Q22               9847  25973  37.912448
Q21               9722  25973  37.431179
Q20               9648  25973  37.146267
q_42_completa     7644  25973  29.430563
Q41               7484  25973  28.814538
q_40_completa     6764  25973  26.042429
Q14               2003  25973   7.711855
Q11               1253  25973   4.824241
q_10_completa     1163  25973   4.477727
Q9                1039  25973   4.000308
Q8                1033  25973   3.977207
Q7                1032  25973   3.973357
gender               0  25973   0.000000
Q5                   0  25973   0.000000
Q4                   0  25973   0.000000
Q3                   0  25973   0.000000
age                  0  25973   0.000000

In [13]:
df['Q33'].unique()

array([nan, 'MySQL ', 'IBM Db2 ', 'PostgreSQL ',
       'Google Cloud Firestore ', 'Oracle Database ',
       'Microsoft SQL Server ', 'Microsoft Azure SQL Database ',
       'Snowflake ', 'MongoDB ', 'Google Cloud BigQuery ',
       'Amazon DynamoDB ', 'SQLite ', 'Amazon RDS ', 'Amazon Redshift ',
       'Google Cloud BigTable ', 'Google Cloud SQL ',
       'Microsoft Azure Cosmos DB ', 'Other', 'Amazon Aurora ',
       'Google Cloud Spanner '], dtype=object)

In [14]:
df['Q32'].unique()

array([' PostgreSQL ', nan, 'MySQL , MongoDB ', ...,
       ' MongoDB , Microsoft SQL Server , Amazon Redshift ',
       'MySQL , SQLite , MongoDB , Google Cloud BigTable ',
       ' PostgreSQL , SQLite , MongoDB , Microsoft SQL Server , Amazon Redshift '],
      dtype=object)

In [16]:
df['Q33'].value_counts()

MySQL                            1110
PostgreSQL                        694
Microsoft SQL Server              611
MongoDB                           342
Oracle Database                   316
Google Cloud BigQuery             298
SQLite                            235
Microsoft Azure SQL Database      191
Amazon Redshift                   146
Snowflake                         132
Amazon RDS                         94
Google Cloud SQL                   79
IBM Db2                            78
Amazon DynamoDB                    77
Other                              64
Google Cloud Firestore             60
Microsoft Azure Cosmos DB          54
Amazon Aurora                      34
Google Cloud BigTable              31
Google Cloud Spanner               10
Name: Q33, dtype: int64

In [15]:
df['Q32'].value_counts()

 None                                                                                                                                                                                2297
MySQL                                                                                                                                                                                 754
 PostgreSQL                                                                                                                                                                           288
 Microsoft SQL Server                                                                                                                                                                 287
MySQL , SQLite                                                                                                                                                                        177
                                                                                                                                                                                     ...
MySQL , PostgreSQL , SQLite , Oracle Database , Snowflake , Microsoft SQL Server , Microsoft Azure SQL Database                                                                         1
MySQL , Google Cloud BigTable , Google Cloud Spanner                                                                                                                                    1
MySQL , PostgreSQL , Microsoft Azure SQL Database , Microsoft Azure Cosmos DB , Amazon Redshift , Amazon Aurora , Amazon DynamoDB , Google Cloud BigQuery , Google Cloud Spanner        1
MySQL , Amazon Redshift , Amazon Aurora                                                                                                                                                 1
 PostgreSQL , SQLite , MongoDB , Microsoft SQL Server , Amazon Redshift                                                                                                                 1
Name: Q32, Length: 1558, dtype: int64

In [17]:
df_copia = df.copy()

In [22]:
q32_split = pd.DataFrame(df_copia['Q32'].str.split(' , '))
q32_split

                                                                          Q32
0                                                              [ PostgreSQL ]
1                                                                         NaN
2                                                           [MySQL, MongoDB ]
3                                                                         NaN
4                                                                     [ None]
...                                                                       ...
25968  [ PostgreSQL, SQLite, MongoDB, Microsoft SQL Server, Amazon Redshift ]
25969                                                                     NaN
25970                                                                     NaN
25971                                                                     NaN
25972                                                                     NaN

[25973 rows x 1 columns]

In [23]:
q32_split.explode(['Q32'])

                    Q32
0           PostgreSQL
1                   NaN
2                 MySQL
2              MongoDB
3                   NaN
...                 ...
25968  Amazon Redshift
25969               NaN
25970               NaN
25971               NaN
25972               NaN

[37596 rows x 1 columns]

In [25]:
q32_split['Q32'].value_counts()

TypeError: unhashable type: 'list'

Exception ignored in: 'pandas._libs.index.IndexEngine._call_map_locations'
Traceback (most recent call last):
  File "pandas/_libs/hashtable_class_helper.pxi", line 5231, in pandas._libs.hashtable.PyObjectHashTable.map_locations
TypeError: unhashable type: 'list'

[ None]                                                                                                                                                                        2297
[MySQL ]                                                                                                                                                                        754
[ PostgreSQL ]                                                                                                                                                                  288
[ Microsoft SQL Server ]                                                                                                                                                        287
[MySQL, SQLite ]                                                                                                                                                                177
                                                                                                                                                                               ...
[MySQL, PostgreSQL, SQLite, Oracle Database, Snowflake, Microsoft SQL Server, Microsoft Azure SQL Database ]                                                                      1
[MySQL, Google Cloud BigTable, Google Cloud Spanner ]                                                                                                                             1
[MySQL, PostgreSQL, Microsoft Azure SQL Database, Microsoft Azure Cosmos DB, Amazon Redshift, Amazon Aurora, Amazon DynamoDB, Google Cloud BigQuery, Google Cloud Spanner ]       1
[MySQL, Amazon Redshift, Amazon Aurora ]                                                                                                                                          1
[ PostgreSQL, SQLite, MongoDB, Microsoft SQL Server, Amazon Redshift ]                                                                                                            1
Name: Q32, Length: 1558, dtype: int64